In [1]:
import pandas as pd
import numpy as np

# Question 1

Consider the two DataFrames shown below, both of which have Name as the index. Which of the following expressions can be used to get the data of all students (from student_df) including their roles as staff, where nan denotes no role?

```python 
pd.merge(student_df, staff_df, how='left', left_index=True, right_index=True)

pd.merge(staff_df, student_df, how='right', left_index=False, right_index=True) # muss pass left index True

pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

pd.merge(student_df, staff_df, how='right', left_index=True, right_index=True)

```

In [2]:
student_df = pd.DataFrame({ "Name" : ["James", "Mike", "Sally"], 
                           "School" : ["Business", "Law", "Engineering"]})

student_df = student_df.set_index('Name')
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [3]:
staff_df = pd.DataFrame({ "Name" : ["Kelly", "Sally", "James"], 
                           "Role" : ["Director of HR", "Course Liason", "Grader"]})

staff_df = staff_df.set_index('Name')
staff_df

                 Role
Name
Kelly  Director of HR
Sally   Course Liason
James          Grader

In [4]:
pd.merge(student_df, staff_df, how='left', left_index=True, right_index=True)

            School           Role
Name
James     Business         Grader
Mike           Law            NaN
Sally  Engineering  Course Liason

In [5]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally   Course Liason  Engineering
James          Grader     Business

# Question 2

Consider a DataFrame named df with columns named P2010, P2011, P2012, P2013, 2014 and P2015 containing float values.  We want to use the apply method to get a new DataFrame named result_df with a new column AVG. The AVG column should average the float values across P2010 to P2015. The apply method should also remove the 6 original columns (P2010 to P2015). For that, what should be the value of x and y in the given code?


```python 
frames = ['P2010', 'P2011', 'P2012', 'P2013', 'P2014', 'P2015']

df['AVG'] = df[frames].apply(lambda z : np.mean(z), axis = x)

result_df = df.drop(frames, axis = y)
```


I answered

x = 0
y = 0

What's the correct answer and why is mine wrong?

In [6]:
x = 0
y = 1

When it comes to removing null values we refer to the axis we want to drop

0, or ‘index’ : Drop rows which contain missing values.
1, or ‘columns’ : Drop columns which contain missing value.
Actually it will depend with the method being used. Mostly for computation (mean, median etc…) it means:

Axis 0 will act on all the ROWS in each COLUMN
Axis 1 will act on all the COLUMNS in each ROW

y = 1

## Axis in the method drop

In [7]:
data = {'col1': [1, 2, 3], 'col2': ['apple', 'banana', 'cherry'], 'col3': [4.5, 5.2, 6.1]}
df = pd.DataFrame(data)
df

   col1    col2  col3
0     1   apple   4.5
1     2  banana   5.2
2     3  cherry   6.1

In [8]:
# Drop the first row (index 0)
df_dropped_rows = df.drop(0, axis=0)  # Drop row at index 0df_dropped_rows
df_dropped_rows

   col1    col2  col3
1     2  banana   5.2
2     3  cherry   6.1

# Axis in methods like mean()

In [9]:
data1 = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data1)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [10]:
# Calculate the mean across rows (mean of each column)
row_means = df.mean(axis=0)
row_means

col1    2.0
col2    5.0
col3    8.0
dtype: float64

# Question 3. How to create a dataframe with the indices right away!
cv

 # Question 5

 Assume that the date '11/29/2019' in MM/DD/YYYY format is the 4th day of the week, what will be the result of the following?

In [11]:
date = pd.Timestamp('11/29/2019')
date.weekday()

4

In [12]:
pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()

Timestamp('2019-11-30 00:00:00')

In [13]:
pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd() - pd.Timestamp('11/29/2019')

Timedelta('1 days 00:00:00')

In [14]:
(date + pd.offsets.MonthEnd()).weekday()

5

# Question 7

Consider the DataFrames above, both of which have a standard integer based index. Which of the following can be used to get the data of all students (from student_df) and merge it with their staff roles where nan denotes no role?

# Question 9

In [15]:
pd.Period('01/12/19', 'M')+5

Period('2019-06', 'M')